app/controllers/articles_controller.rb

  def update
    set_article
    @article.update(title: params[:article][:title], description: params[:article][:title])
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-06-23 05:56:26.084535"], ["id", 1]]